from time import*
def main(request):
    if '0' in request:
        print('------------------------------------------------------------------------------------------------------------------'
            '\nЗавершение работы!'
            '\n------------------------------------------------------------------------------------------------------------------')
        sleep(1)
        exit()

    elif 'расписание' in request or '1' in request:
        schedule()

    elif 'цена' in request or '2' in request:
        price()

    elif 'тренер' in request or '3' in request:
        contacts()

    elif 'адрес' in request or '4' in request:
        location()

    elif 'экипировка' in request or '5' in request:
        first_training()

    else:
        print('Ничего не понял, выберите одну из пяти категорий \n(＞ｍ＜)')
        main(request=input(categories).lower())

def schedule():
    day = input('------------------------------------------------------------------------------------------------------------------'
                '\nВыберите день недели(для возврата нажмите 0): ').lower()

    if 'понедельник' in day:
        print(sched_1)

    elif 'вторник' in day:
        print(sched_2)

    elif 'среда' in day:
        print(sched_1)

    elif 'четверг' in day:
        print(sched_2)

    elif 'пятница' in day:
        print(sched_1)

    elif 'суббота' in day:
        print('------------------------------------------------------------------------------------------------------------------'
              '\nОФП на свежем воздухе:'
              '\nВремя: 16:00 - 18:00')

    elif 'воскресенье' in day:
        print('Вам заняться нечем в этот день? Отдыхайте! \n(▽◕ ᴥ ◕▽)')

    elif '0' in day:
        main(request=input(categories).lower())

    else:
        print('Неверный запрос, попробуйте еще раз!')
        schedule()

    sleep(1)
    sched_restart()


def price():
    print ('------------------------------------------------------------------------------------------------------------------'
           '\nЦена: '
           '\nДзюдо - детская группа: 5000руб./мес.'
           '\nДзюдо - взрослая группа: 6500руб/мес.'
           '\nФитнес: 10000руб/мес.'
           '\n(」°ロ°)」')

    sleep(1)
    restart()


def contacts():
    print ('------------------------------------------------------------------------------------------------------------------'
           '\nДзюдо: Тренер - Гомзяков Борис Игоревич \nтел. 8(800)-555-35-35'
           '\nФитнес: Тренер - Жижонкова Маргарита Сергеевна \nтел. 8(925)-444-55-66'
           '\n(￣ρ￣)..zzZZ')

    sleep(1)
    restart()


def location():
    loc =  input('------------------------------------------------------------------------------------------------------------------'
                 '\nСписок городов:'
                 '\n1)Сочи'
                 '\n2)Краснодар'
                 '\n3)Томск'
                 '\n4)Москва'
                 '\n5)Санкт-Петербург'
                 '\nВыберите ваш город(для возврата нажмите 0): ').lower()

    if 'сочи' in loc or '1' in loc:
        print('------------------------------------------------------------------------------------------------------------------'
              '\nг. Сочи, Центральный Район, ул. Северная 6'
              '\nг.Сочи, Адлерский район, пгт. Сириус, ул. Воскресенская 12')

    elif 'краснодар' in loc or '2' in loc:
        print('------------------------------------------------------------------------------------------------------------------'
              '\nул. Красная 15')

    elif 'томск' in loc or '3' in loc:
        print('------------------------------------------------------------------------------------------------------------------'
              '\nЦветочный переулок 14')

    elif 'москва' in loc or '4' in loc:
        print('------------------------------------------------------------------------------------------------------------------'
              '\nр-н Донской, 5-й Донской пр-д 21, корпус 4')

    elif 'санкт петербург' in loc or 'петербург' in loc or 'питер' in loc or '5' in loc:
        print ('------------------------------------------------------------------------------------------------------------------'
               '\nСертолово, ул. Молодцова 8, корпус 2')

    elif '0' in loc:
        main(request=input(categories).lower())

    else:
        print('------------------------------------------------------------------------------------------------------------------'
              '\nНичего не понял, пожалуйста, повторите запрос  (＞ｍ＜)')
        location()

    sleep(1)
    loc_restart()


def first_training():
    print('------------------------------------------------------------------------------------------------------------------'
          '\nЗапись на пробное занятие'
          '\nтел: 8(918)-100-00-00(Привязан к WhatsUp)'
          '\nTelegram: @mybeautifulmadness1(зайдите сюда плиз)')

    sleep(1)
    restart()


def restart():
    x = input('------------------------------------------------------------------------------------------------------------------'
        '\nНажмите 0, чтобы вернуться назад: ')
    if '0' in x:
        main(request=input(categories).lower())
    else:
        print('ПОЗДРАВЛЯЮ, ВЫ - КРИВОРУКИЙ! ')
        sleep(1)
        error = input('Нажмите любую клавишу для перезапуска программы')
        if '' in error:
            main(request=input(categories).lower())

def loc_restart():
    x = input('------------------------------------------------------------------------------------------------------------------'
            '\nНажмите 0, чтобы вернуться назад. Нажмите 1, чтобы посмотреть адрес в другом городе: ')
    if '0' in x:
        main(request=input(categories).lower())
    elif '1' in x:
        location()
    else:
        print('ПОЗДРАВЛЯЮ, ВЫ - КРИВОРУКИЙ! ')
        sleep(1)
        error = input('Нажмите любую клавишу для перезапуска программы')
        if '' in error:
            main(request=input(categories).lower())


def sched_restart():
    x = input(
        '------------------------------------------------------------------------------------------------------------------'
        '\nНажмите 0, чтобы вернуться назад. Нажмите 1, чтобы посмотреть расписание на другой день: ')
    if '0' in x:
        main(request=input(categories).lower())
    elif '1' in x:
        schedule()
    else:
        print('ПОЗДРАВЛЯЮ, ВЫ - КРИВОРУКИЙ! ')
        sleep(1)
        error = input('Нажмите любую клавишу для перезапуска программы')
        if '' in error:
            main(request=input(categories).lower())


sched_1 = ('------------------------------------------------------------------------------------------------------------------'
            '\nДзюдо:'
            '\nДетская группа: 16:30 - 18:00'
            '\nВзрослая группа: 19:00 - 21:00'
            '\n(▽◕ ᴥ ◕▽)')

sched_2 = ('------------------------------------------------------------------------------------------------------------------'
              '\nФитнес и тренировки в зале:'
              '\nАэробика: 15:00 -16:30'
              '\nСиловые тренировки: 18:00 - 20:00'
              '\n(▽◕ ᴥ ◕▽)')


categories = ('------------------------------------------------------------------------------------------------------------------'
   '\nКатегории: '
   '\n1)Расписание '
   '\n2)Цена '
   '\n3)Тренер '
   '\n4)Адрес '
   '\n5)Пробное занятие '
   '\n0 - Выключить программу'
   '\nВыберите категорию: ')