"""
Создайте список предметов формата Название, препод, ваша любовь к предмету(от 0 до 10).
Сохраните в CSV файл(название файла - ваша фамилия).
P.S не менее 4 столбцов.
"""



import csv

data = [["Название", "Препод", "Любовь к предмету"],
        ["Питон", "Олег Бабченок", "10"],
        ["Высшая математика", "Борис Гомзяков", "10"],
        ["Архитектура и дизайн сетей", "Вячеслав Головин", "9"],
        ["Инфобез", "Сергей Кулаков", "10"],
        ["АСВТ", "Дмитрий Торшин", "9"]
]

with open('Task3.csv', 'w') as f:
    writer = csv.writer(f)
    for row in data:
        writer.writerow(row)
